damiMela/TC1-RLC-Meter/NXP845/RLC_MeterV2/Debug/LPC84x_peripheral.xml
        <register>
          <name>MAINCLKUEN</name>
          <description>Main clock source update enable register</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>ENA</name>
              <description>Enable main clock source update</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>no change</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>update clock source</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSAHBCLKDIV</name>
          <description>System clock divider register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>DIV</name>
              <description>System AHB clock divider values 0: System clock disabled. 1: Divide by 1. to 255: Divide by 255.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAPTCLKSEL</name>
          <description>CAPT clock source select register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7</resetValue>
          <resetMask>0x7</resetMask>
          <fields>
            <field>
              <name>SEL</name>
              <description>Clock source for CAPT clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>3b000</name>
                  <description>FRO</description>
                  <value>#000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3b001</name>
                  <description>main clock</description>
                  <value>#001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3b010</name>
                  <description>sys pll</description>
                  <value>#010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3b011</name>
                  <description>FRO_DIV</description>
                  <value>#011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3b100</name>
                  <description>Watchdog oscillator</description>
                  <value>#100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3b101</name>
                  <description>None</description>
                  <value>#101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3b110</name>
                  <description>None</description>
                  <value>#110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3b111</name>
                  <description>None</description>
                  <value>#111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCCLKSEL</name>
          <description>ADC clock source select register</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0x3</resetMask>
          <fields>
            <field>
              <name>SEL</name>
              <description>Clock source for ADC clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>2b00</name>
                  <description>FRO</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2b01</name>
                  <description>sys pll</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2b10</name>
                  <description>none</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2b11</name>
                  <description>none</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCCLKDIV</name>
          <description>ADC clock divider register</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>DIV</name>
              <description>ADC clock divider values 0: ADC clock disabled. 1: Divide by 1. to 255: Divide by 255.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCTCLKSEL</name>
          <description>SCT clock source select register</description>
          <addressOffset>0x6C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0x3</resetMask>
          <fields>
            <field>
              <name>SEL</name>
              <description>Clock source for SCT clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>2b00</name>
                  <description>FRO</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2b01</name>
                  <description>main clock</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2b10</name>
                  <description>sys pll</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2b11</name>
                  <description>none</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SCTCLKDIV</name>
          <description>SCT clock divider register</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>DIV</name>
              <description>SCT clock divider values 0: SCT clock disabled. 1: Divide by 1. to 255: Divide by 255.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTCLKSEL</name>
          <description>external clock source select register</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>SEL</name>
              <description>Clock source for external clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1b0</name>
                  <description>System oscillator</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1b1</name>
                  <description>Clk_in</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
