damiMela/TC1-RLC-Meter/NXP845/RLC_MeterV2/Debug/LPC84x_peripheral.xml
        <register>
          <name>PRESET1CTRL</name>
          <description>Peripheral reset group 1 control register</description>
          <addressOffset>0x8C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1F</resetValue>
          <resetMask>0x1F</resetMask>
          <fields>
            <field>
              <name>CAPT_RST_N</name>
              <description>Capacitive touch reset control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1b0</name>
                  <description>Assert the capacitive touch reset.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1b1</name>
                  <description>Clear the capacitive touch reset.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DAC1_RST_N</name>
              <description>DAC1 reset control</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1b0</name>
                  <description>Assert the DAC1 reset.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1b1</name>
                  <description>Clear the DAC1 reset.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FAIM_RST_N</name>
              <description>FAIM controller reset control</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1b0</name>
                  <description>Assert the FAIM controller reset.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1b1</name>
                  <description>Clear the FAIM controller reset.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRG0_RST_N</name>
              <description>Fractional baud rate generator 0 reset control</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1b0</name>
                  <description>Assert the FRG0 reset.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1b1</name>
                  <description>Clear the FRG0 reset.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRG1_RST_N</name>
              <description>Fractional baud rate generator 1 reset control</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1b0</name>
                  <description>Assert the FRG1 reset.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1b1</name>
                  <description>Clear the FRG1 reset.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FCLK0SEL</name>
          <description>peripheral clock source select register. FCLK0SEL~FCLK4SEL are for UART0~UART4 clock source select register. FCLK5SEL~FCLK8SEL are for I2C0~I2C3 clock source select register. FCLK9SEL~FCLK10SEL are for SPI0~SPI1 clock source select register.</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7</resetValue>
          <resetMask>0x7</resetMask>
          <fields>
            <field>
              <name>SEL</name>
              <description>Peripheral clock source</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>3b000</name>
                  <description>FRO</description>
                  <value>#000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3b001</name>
                  <description>main clock</description>
                  <value>#001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3b010</name>
                  <description>Frg0clk</description>
                  <value>#010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3b011</name>
                  <description>Frg1clk</description>
                  <value>#011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3b100</name>
                  <description>FRO_DIV</description>
                  <value>#100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3b101</name>
                  <description>none</description>
                  <value>#101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3b110</name>
                  <description>none</description>
                  <value>#110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3b111</name>
                  <description>none</description>
                  <value>#111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FCLK1SEL</name>
          <description>peripheral clock source select register. FCLK0SEL~FCLK4SEL are for UART0~UART4 clock source select register. FCLK5SEL~FCLK8SEL are for I2C0~I2C3 clock source select register. FCLK9SEL~FCLK10SEL are for SPI0~SPI1 clock source select register.</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7</resetValue>
          <resetMask>0x7</resetMask>
          <fields>
            <field>
              <name>SEL</name>
              <description>Peripheral clock source</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>3b000</name>
                  <description>FRO</description>
                  <value>#000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3b001</name>
                  <description>main clock</description>
                  <value>#001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3b010</name>
                  <description>Frg0clk</description>
                  <value>#010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3b011</name>
                  <description>Frg1clk</description>
                  <value>#011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3b100</name>
                  <description>FRO_DIV</description>
                  <value>#100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3b101</name>
                  <description>none</description>
                  <value>#101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3b110</name>
                  <description>none</description>
                  <value>#110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3b111</name>
                  <description>none</description>
                  <value>#111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FCLK2SEL</name>
          <description>peripheral clock source select register. FCLK0SEL~FCLK4SEL are for UART0~UART4 clock source select register. FCLK5SEL~FCLK8SEL are for I2C0~I2C3 clock source select register. FCLK9SEL~FCLK10SEL are for SPI0~SPI1 clock source select register.</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7</resetValue>
          <resetMask>0x7</resetMask>
          <fields>
            <field>
              <name>SEL</name>
              <description>Peripheral clock source</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>3b000</name>
                  <description>FRO</description>
                  <value>#000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3b001</name>
                  <description>main clock</description>
                  <value>#001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3b010</name>
                  <description>Frg0clk</description>
                  <value>#010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3b011</name>
                  <description>Frg1clk</description>
                  <value>#011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3b100</name>
                  <description>FRO_DIV</description>
                  <value>#100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3b101</name>
                  <description>none</description>
                  <value>#101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3b110</name>
                  <description>none</description>
                  <value>#110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3b111</name>
                  <description>none</description>
                  <value>#111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FCLK3SEL</name>
          <description>peripheral clock source select register. FCLK0SEL~FCLK4SEL are for UART0~UART4 clock source select register. FCLK5SEL~FCLK8SEL are for I2C0~I2C3 clock source select register. FCLK9SEL~FCLK10SEL are for SPI0~SPI1 clock source select register.</description>
          <addressOffset>0x9C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7</resetValue>
          <resetMask>0x7</resetMask>
          <fields>
            <field>
              <name>SEL</name>
              <description>Peripheral clock source</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>3b000</name>
                  <description>FRO</description>
                  <value>#000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3b001</name>
                  <description>main clock</description>
                  <value>#001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3b010</name>
                  <description>Frg0clk</description>
                  <value>#010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3b011</name>
                  <description>Frg1clk</description>
                  <value>#011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3b100</name>
                  <description>FRO_DIV</description>
                  <value>#100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3b101</name>
                  <description>none</description>
                  <value>#101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3b110</name>
                  <description>none</description>
                  <value>#110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3b111</name>
                  <description>none</description>
                  <value>#111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FCLK4SEL</name>
          <description>peripheral clock source select register. FCLK0SEL~FCLK4SEL are for UART0~UART4 clock source select register. FCLK5SEL~FCLK8SEL are for I2C0~I2C3 clock source select register. FCLK9SEL~FCLK10SEL are for SPI0~SPI1 clock source select register.</description>
          <addressOffset>0xA0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7</resetValue>
          <resetMask>0x7</resetMask>
          <fields>
            <field>
              <name>SEL</name>
              <description>Peripheral clock source</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>3b000</name>
                  <description>FRO</description>
                  <value>#000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3b001</name>
                  <description>main clock</description>
                  <value>#001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3b010</name>
                  <description>Frg0clk</description>
                  <value>#010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3b011</name>
                  <description>Frg1clk</description>
                  <value>#011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3b100</name>
                  <description>FRO_DIV</description>
                  <value>#100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3b101</name>
                  <description>none</description>
                  <value>#101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3b110</name>
                  <description>none</description>
                  <value>#110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3b111</name>
                  <description>none</description>
                  <value>#111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FCLK5SEL</name>
          <description>peripheral clock source select register. FCLK0SEL~FCLK4SEL are for UART0~UART4 clock source select register. FCLK5SEL~FCLK8SEL are for I2C0~I2C3 clock source select register. FCLK9SEL~FCLK10SEL are for SPI0~SPI1 clock source select register.</description>
          <addressOffset>0xA4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7</resetValue>
          <resetMask>0x7</resetMask>
          <fields>
            <field>
              <name>SEL</name>
              <description>Peripheral clock source</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>3b000</name>
                  <description>FRO</description>
                  <value>#000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3b001</name>
                  <description>main clock</description>
                  <value>#001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3b010</name>
                  <description>Frg0clk</description>
                  <value>#010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3b011</name>
                  <description>Frg1clk</description>
                  <value>#011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3b100</name>
                  <description>FRO_DIV</description>
                  <value>#100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3b101</name>
                  <description>none</description>
                  <value>#101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3b110</name>
                  <description>none</description>
                  <value>#110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3b111</name>
                  <description>none</description>
                  <value>#111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FCLK6SEL</name>
          <description>peripheral clock source select register. FCLK0SEL~FCLK4SEL are for UART0~UART4 clock source select register. FCLK5SEL~FCLK8SEL are for I2C0~I2C3 clock source select register. FCLK9SEL~FCLK10SEL are for SPI0~SPI1 clock source select register.</description>
          <addressOffset>0xA8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7</resetValue>
          <resetMask>0x7</resetMask>
          <fields>
            <field>
              <name>SEL</name>
              <description>Peripheral clock source</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>3b000</name>
                  <description>FRO</description>
                  <value>#000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3b001</name>
                  <description>main clock</description>
                  <value>#001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3b010</name>
                  <description>Frg0clk</description>
                  <value>#010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3b011</name>
                  <description>Frg1clk</description>
                  <value>#011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3b100</name>
                  <description>FRO_DIV</description>
                  <value>#100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3b101</name>
                  <description>none</description>
                  <value>#101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3b110</name>
                  <description>none</description>
                  <value>#110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3b111</name>
                  <description>none</description>
                  <value>#111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FCLK7SEL</name>
          <description>peripheral clock source select register. FCLK0SEL~FCLK4SEL are for UART0~UART4 clock source select register. FCLK5SEL~FCLK8SEL are for I2C0~I2C3 clock source select register. FCLK9SEL~FCLK10SEL are for SPI0~SPI1 clock source select register.</description>
          <addressOffset>0xAC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7</resetValue>
          <resetMask>0x7</resetMask>
          <fields>
            <field>
              <name>SEL</name>
              <description>Peripheral clock source</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>3b000</name>
                  <description>FRO</description>
                  <value>#000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3b001</name>
                  <description>main clock</description>
                  <value>#001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3b010</name>
                  <description>Frg0clk</description>
                  <value>#010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3b011</name>
                  <description>Frg1clk</description>
                  <value>#011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3b100</name>
                  <description>FRO_DIV</description>
                  <value>#100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3b101</name>
                  <description>none</description>
                  <value>#101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3b110</name>
                  <description>none</description>
                  <value>#110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3b111</name>
                  <description>none</description>
                  <value>#111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
