damiMela/TC1-RLC-Meter/NXP845/RLC_MeterV2/Debug/LPC84x_peripheral.xml
      </registers>
    </peripheral>
<peripheral>
	<name>DCR</name>
	<description>Debug Core Registers (v6M)</description>
	<baseAddress>0xE000EDF0</baseAddress>
	<registers>
		<register>
			<name>DHCSR</name>
			<description>Debug Halting Control and Status Register</description>
			<addressOffset>0x00</addressOffset>
			<size>32</size>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<fields>
				<field>
					<name>S_RESET_ST</name>
					<description>Indicates that the core has been reset</description>
					<bitOffset>25</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>S_RETIRE_ST</name>
					<description>Indicates that an instruction has completed since last read</description>
					<bitOffset>24</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>S_LOCKUP</name>
					<description>lockup condition is present</description>
					<bitOffset>19</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>S_SLEEP</name>
					<description>Indicates that the core is sleeping (WFI or WFE or SLEEP-ON-EXIT).</description>
					<bitOffset>18</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>S_HALT</name>
					<description>The core is in debug state when S_HALT is set</description>
					<bitOffset>17</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>S_REGRDY</name>
					<description>Register Read/Write on the Debug Core Register Selector register is available</description>
					<bitOffset>16</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>C_MASKINTS</name>
					<description>Mask interrupts when stepping or running in halted debug</description>
					<bitOffset>3</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>C_STEP</name>
					<description>Steps the core in halted debug</description>
					<bitOffset>2</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>C_HALT</name>
					<description>Halts the core</description>
					<bitOffset>1</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>C_DEBUGEN</name>
					<description>Enables debug</description>
					<bitOffset>0</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
			</fields>
		</register>
		<register>
			<name>DCSR</name>
			<description>Debug Core Register Selector Register</description>
			<addressOffset>0x04</addressOffset>
			<size>32</size>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<fields>
				<field>
					<name>REGWnR</name>
					<description>REGWnR</description>
					<bitOffset>16</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>REGSEL</name>
					<description>REGSEL</description>
					<bitOffset>0</bitOffset>
					<bitWidth>5</bitWidth>
					<access>read-write</access>
				</field>
			</fields>
		</register>
		<register>
			<name>DCRDR</name>
			<description>Debug Core Register Data Register</description>
			<addressOffset>0x08</addressOffset>
			<size>32</size>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
		</register>
		<register>
			<name>DEMCR</name>
			<description>Debug Exception and Monitor Control Register</description>
			<addressOffset>0x0c</addressOffset>
			<size>32</size>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<fields>
				<field>
					<name>DWTENA</name>
					<description>This bit must be set to 1 to enable use of the debug blocks</description>
					<bitOffset>24</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>VC_HARDERR</name>
					<description>Debug trap on Hard Fault</description>
					<bitOffset>10</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>VC_CORERESET</name>
					<description>Reset Vector Catch. Halt running system if Core reset occurs</description>
					<bitOffset>0</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
			</fields>
		</register>
	</registers>
</peripheral>
<peripheral>
	<name>NVIC</name>
	<description>NVIC Control/Status Registers (v6M)</description>
	<baseAddress>0xE000E000</baseAddress>
	<registers>
		<register>
			<name>SCB_ACTLR</name>
			<description>Auxiliary control register</description>
			<addressOffset>0x008</addressOffset>
			<size>32</size>
			<access>read-write</access>
		</register>
		<register>
			<name>SYSTICK_CTRL</name>
			<description>SysTick Control and Status Register</description>
			<addressOffset>0x010</addressOffset>
			<size>32</size>
			<access>read-write</access>
			<fields>
				<field>
					<name>COUNTFLAG</name>
					<description>When set -  SysTick timer has reached zero</description>
					<bitOffset>16</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>CLKSOURCE</name>
					<description>Value of 1 indicates core clock is used for SysTick timer</description>
					<bitOffset>2</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>TICKINT</name>
					<description>When set - SysTick exception generated when SysTick timer counts down to zero</description>
					<bitOffset>1</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ENABLE</name>
					<description>When set - SysTick timer is enabled</description>
					<bitOffset>0</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
			</fields>
		</register>
		<register>
			<name>SYSTICK_LOAD</name>
			<description>SysTick Reload Value Register</description>
			<addressOffset>0x014</addressOffset>
			<size>32</size>
			<access>read-write</access>
		</register>
		<register>
			<name>SYSTICK_VAL</name>
			<description>SysTick Current Value Register</description>
			<addressOffset>0x018</addressOffset>
			<size>32</size>
			<access>read-write</access>
		</register>
		<register>
			<name>SYSTICK_CALIB</name>
			<description>SysTick Calibration Value Register</description>
			<addressOffset>0x01c</addressOffset>
			<size>32</size>
			<access>read-write</access>
		</register>
        <register>
			<name>NVIC_ISER</name>
			<description>NVIC Set Enable Register for interrupts 0 to 31</description>
			<addressOffset>0x100</addressOffset>
			<size>32</size>
			<access>read-write</access>
			<fields>
				<field>
					<name>SetEnable_31</name>
					<description>Set Enable for interrupt #31 (exception #47)</description>
					<bitOffset>31</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_30</name>
					<description>Set Enable for interrupt #30 (exception #46)</description>
					<bitOffset>30</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_29</name>
					<description>Set Enable for interrupt #29 (exception #45)</description>
					<bitOffset>29</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_28</name>
					<description>Set Enable for interrupt #28 (exception #44)</description>
					<bitOffset>28</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_27</name>
					<description>Set Enable for interrupt #27 (exception #43)</description>
					<bitOffset>27</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_26</name>
					<description>Set Enable for interrupt #26 (exception #42)</description>
					<bitOffset>26</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_25</name>
					<description>Set Enable for interrupt #25 (exception #41)</description>
					<bitOffset>25</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_24</name>
					<description>Set Enable for interrupt #24 (exception #40)</description>
					<bitOffset>24</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_23</name>
					<description>Set Enable for interrupt #23 (exception #39)</description>
					<bitOffset>23</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_22</name>
					<description>Set Enable for interrupt #22 (exception #38)</description>
					<bitOffset>22</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_21</name>
					<description>Set Enable for interrupt #21 (exception #37)</description>
					<bitOffset>21</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_20</name>
					<description>Set Enable for interrupt #20 (exception #36)</description>
					<bitOffset>20</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_19</name>
					<description>Set Enable for interrupt #19 (exception #35)</description>
					<bitOffset>19</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_18</name>
					<description>Set Enable for interrupt #18 (exception #34)</description>
					<bitOffset>18</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_17</name>
					<description>Set Enable for interrupt #17 (exception #33)</description>
					<bitOffset>17</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_16</name>
					<description>Set Enable for interrupt #16 (exception #32)</description>
					<bitOffset>16</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_15</name>
					<description>Set Enable for interrupt #15 (exception #31)</description>
					<bitOffset>15</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_14</name>
					<description>Set Enable for interrupt #14 (exception #30)</description>
					<bitOffset>14</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_13</name>
					<description>Set Enable for interrupt #13 (exception #29)</description>
					<bitOffset>13</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_12</name>
					<description>Set Enable for interrupt #12 (exception #28)</description>
					<bitOffset>12</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_11</name>
					<description>Set Enable for interrupt #11 (exception #27)</description>
					<bitOffset>11</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_10</name>
					<description>Set Enable for interrupt #10 (exception #26)</description>
					<bitOffset>10</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_09</name>
					<description>Set Enable for interrupt #09 (exception #25)</description>
					<bitOffset>09</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_08</name>
					<description>Set Enable for interrupt #08 (exception #24)</description>
					<bitOffset>08</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_07</name>
					<description>Set Enable for interrupt #07 (exception #23)</description>
					<bitOffset>07</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_06</name>
					<description>Set Enable for interrupt #06 (exception #22)</description>
					<bitOffset>06</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_05</name>
					<description>Set Enable for interrupt #05 (exception #21)</description>
					<bitOffset>05</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_04</name>
					<description>Set Enable for interrupt #04 (exception #20)</description>
					<bitOffset>04</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_03</name>
					<description>Set Enable for interrupt #03 (exception #19)</description>
					<bitOffset>03</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_02</name>
					<description>Set Enable for interrupt #02 (exception #18)</description>
					<bitOffset>02</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_01</name>
					<description>Set Enable for interrupt #01 (exception #17)</description>
					<bitOffset>01</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_00</name>
					<description>Set Enable for interrupt #00 (exception #16)</description>
					<bitOffset>00</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
			</fields>
		</register>
        <register>
			<name>NVIC_ICER</name>
			<description>NVIC Clear Enable Register for interrupts 0 to 31</description>
			<addressOffset>0x180</addressOffset>
			<size>32</size>
			<access>read-write</access>
			<fields>
				<field>
					<name>ClearEnable_31</name>
					<description>Clear Enable for interrupt #31 (exception #47)</description>
					<bitOffset>31</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_30</name>
					<description>Clear Enable for interrupt #30 (exception #46)</description>
					<bitOffset>30</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_29</name>
					<description>Clear Enable for interrupt #29 (exception #45)</description>
					<bitOffset>29</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_28</name>
					<description>Clear Enable for interrupt #28 (exception #44)</description>
					<bitOffset>28</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_27</name>
					<description>Clear Enable for interrupt #27 (exception #43)</description>
					<bitOffset>27</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_26</name>
					<description>Clear Enable for interrupt #26 (exception #42)</description>
					<bitOffset>26</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_25</name>
					<description>Clear Enable for interrupt #25 (exception #41)</description>
					<bitOffset>25</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_24</name>
					<description>Clear Enable for interrupt #24 (exception #40)</description>
					<bitOffset>24</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_23</name>
					<description>Clear Enable for interrupt #23 (exception #39)</description>
					<bitOffset>23</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_22</name>
					<description>Clear Enable for interrupt #22 (exception #38)</description>
					<bitOffset>22</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_21</name>
					<description>Clear Enable for interrupt #21 (exception #37)</description>
					<bitOffset>21</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_20</name>
					<description>Clear Enable for interrupt #20 (exception #36)</description>
					<bitOffset>20</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_19</name>
					<description>Clear Enable for interrupt #19 (exception #35)</description>
					<bitOffset>19</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_18</name>
					<description>Clear Enable for interrupt #18 (exception #34)</description>
					<bitOffset>18</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_17</name>
					<description>Clear Enable for interrupt #17 (exception #33)</description>
					<bitOffset>17</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_16</name>
					<description>Clear Enable for interrupt #16 (exception #32)</description>
					<bitOffset>16</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_15</name>
					<description>Clear Enable for interrupt #15 (exception #31)</description>
					<bitOffset>15</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_14</name>
					<description>Clear Enable for interrupt #14 (exception #30)</description>
					<bitOffset>14</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_13</name>
					<description>Clear Enable for interrupt #13 (exception #29)</description>
					<bitOffset>13</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_12</name>
					<description>Clear Enable for interrupt #12 (exception #28)</description>
					<bitOffset>12</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_11</name>
					<description>Clear Enable for interrupt #11 (exception #27)</description>
					<bitOffset>11</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_10</name>
					<description>Clear Enable for interrupt #10 (exception #26)</description>
					<bitOffset>10</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_09</name>
					<description>Clear Enable for interrupt #09 (exception #25)</description>
					<bitOffset>09</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_08</name>
					<description>Clear Enable for interrupt #08 (exception #24)</description>
					<bitOffset>08</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_07</name>
					<description>Clear Enable for interrupt #07 (exception #23)</description>
					<bitOffset>07</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_06</name>
					<description>Clear Enable for interrupt #06 (exception #22)</description>
					<bitOffset>06</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_05</name>
					<description>Clear Enable for interrupt #05 (exception #21)</description>
					<bitOffset>05</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_04</name>
					<description>Clear Enable for interrupt #04 (exception #20)</description>
					<bitOffset>04</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_03</name>
					<description>Clear Enable for interrupt #03 (exception #19)</description>
					<bitOffset>03</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_02</name>
					<description>Clear Enable for interrupt #02 (exception #18)</description>
					<bitOffset>02</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_01</name>
					<description>Clear Enable for interrupt #01 (exception #17)</description>
					<bitOffset>01</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearEnable_00</name>
					<description>Clear Enable for interrupt #00 (exception #16)</description>
					<bitOffset>00</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
			</fields>
		</register>
