damiMela/TC1-RLC-Meter/NXP845/RLC_MeterV2/Debug/LPC84x_peripheral.xml
        <register>
			<name>NVIC_ISPR</name>
			<description>NVIC Set Pending Register for interrupts 0 to 31</description>
			<addressOffset>0x200</addressOffset>
			<size>32</size>
			<access>read-write</access>
			<fields>
				<field>
					<name>SetPend_31</name>
					<description>Set Pending for interrupt #31 (exception #47)</description>
					<bitOffset>31</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_30</name>
					<description>Set Pending for interrupt #30 (exception #46)</description>
					<bitOffset>30</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_29</name>
					<description>Set Pending for interrupt #29 (exception #45)</description>
					<bitOffset>29</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_28</name>
					<description>Set Pending for interrupt #28 (exception #44)</description>
					<bitOffset>28</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_27</name>
					<description>Set Pending for interrupt #27 (exception #43)</description>
					<bitOffset>27</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_26</name>
					<description>Set Pending for interrupt #26 (exception #42)</description>
					<bitOffset>26</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_25</name>
					<description>Set Pending for interrupt #25 (exception #41)</description>
					<bitOffset>25</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_24</name>
					<description>Set Pending for interrupt #24 (exception #40)</description>
					<bitOffset>24</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_23</name>
					<description>Set Pending for interrupt #23 (exception #39)</description>
					<bitOffset>23</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_22</name>
					<description>Set Pending for interrupt #22 (exception #38)</description>
					<bitOffset>22</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_21</name>
					<description>Set Pending for interrupt #21 (exception #37)</description>
					<bitOffset>21</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_20</name>
					<description>Set Pending for interrupt #20 (exception #36)</description>
					<bitOffset>20</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_19</name>
					<description>Set Pending for interrupt #19 (exception #35)</description>
					<bitOffset>19</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_18</name>
					<description>Set Pending for interrupt #18 (exception #34)</description>
					<bitOffset>18</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_17</name>
					<description>Set Pending for interrupt #17 (exception #33)</description>
					<bitOffset>17</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_16</name>
					<description>Set Pending for interrupt #16 (exception #32)</description>
					<bitOffset>16</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_15</name>
					<description>Set Pending for interrupt #15 (exception #31)</description>
					<bitOffset>15</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_14</name>
					<description>Set Pending for interrupt #14 (exception #30)</description>
					<bitOffset>14</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_13</name>
					<description>Set Pending for interrupt #13 (exception #29)</description>
					<bitOffset>13</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_12</name>
					<description>Set Pending for interrupt #12 (exception #28)</description>
					<bitOffset>12</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_11</name>
					<description>Set Pending for interrupt #11 (exception #27)</description>
					<bitOffset>11</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_10</name>
					<description>Set Pending for interrupt #10 (exception #26)</description>
					<bitOffset>10</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_09</name>
					<description>Set Pending for interrupt #09 (exception #25)</description>
					<bitOffset>09</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_08</name>
					<description>Set Pending for interrupt #08 (exception #24)</description>
					<bitOffset>08</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_07</name>
					<description>Set Pending for interrupt #07 (exception #23)</description>
					<bitOffset>07</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_06</name>
					<description>Set Pending for interrupt #06 (exception #22)</description>
					<bitOffset>06</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_05</name>
					<description>Set Pending for interrupt #05 (exception #21)</description>
					<bitOffset>05</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_04</name>
					<description>Set Pending for interrupt #04 (exception #20)</description>
					<bitOffset>04</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_03</name>
					<description>Set Pending for interrupt #03 (exception #19)</description>
					<bitOffset>03</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_02</name>
					<description>Set Pending for interrupt #02 (exception #18)</description>
					<bitOffset>02</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_01</name>
					<description>Set Pending for interrupt #01 (exception #17)</description>
					<bitOffset>01</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetPend_00</name>
					<description>Set Pending for interrupt #00 (exception #16)</description>
					<bitOffset>00</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
			</fields>
		</register>
        <register>
			<name>NVIC_ICPR</name>
			<description>NVIC Clear Pending Register for interrupts 0 to 31</description>
			<addressOffset>0x280</addressOffset>
			<size>32</size>
			<access>read-write</access>
			<fields>
				<field>
					<name>ClearPende_31</name>
					<description>Clear Pending for interrupt #31 (exception #47)</description>
					<bitOffset>31</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPende_30</name>
					<description>Clear Pending for interrupt #30 (exception #46)</description>
					<bitOffset>30</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPende_29</name>
					<description>Clear Pending for interrupt #29 (exception #45)</description>
					<bitOffset>29</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPende_28</name>
					<description>Clear Pending for interrupt #28 (exception #44)</description>
					<bitOffset>28</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPende_27</name>
					<description>Clear Pending for interrupt #27 (exception #43)</description>
					<bitOffset>27</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPende_26</name>
					<description>Clear Pending for interrupt #26 (exception #42)</description>
					<bitOffset>26</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPende_25</name>
					<description>Clear Pending for interrupt #25 (exception #41)</description>
					<bitOffset>25</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPende_24</name>
					<description>Clear Pending for interrupt #24 (exception #40)</description>
					<bitOffset>24</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPende_23</name>
					<description>Clear Pending for interrupt #23 (exception #39)</description>
					<bitOffset>23</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPende_22</name>
					<description>Clear Pending for interrupt #22 (exception #38)</description>
					<bitOffset>22</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPende_21</name>
					<description>Clear Pending for interrupt #21 (exception #37)</description>
					<bitOffset>21</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPende_20</name>
					<description>Clear Pending for interrupt #20 (exception #36)</description>
					<bitOffset>20</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPende_19</name>
					<description>Clear Pending for interrupt #19 (exception #35)</description>
					<bitOffset>19</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPende_18</name>
					<description>Clear Pending for interrupt #18 (exception #34)</description>
					<bitOffset>18</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPende_17</name>
					<description>Clear Pending for interrupt #17 (exception #33)</description>
					<bitOffset>17</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPende_16</name>
					<description>Clear Pending for interrupt #16 (exception #32)</description>
					<bitOffset>16</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPende_15</name>
					<description>Clear Pending for interrupt #15 (exception #31)</description>
					<bitOffset>15</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPende_14</name>
					<description>Clear Pending for interrupt #14 (exception #30)</description>
					<bitOffset>14</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPende_13</name>
					<description>Clear Pending for interrupt #13 (exception #29)</description>
					<bitOffset>13</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPende_12</name>
					<description>Clear Pending for interrupt #12 (exception #28)</description>
					<bitOffset>12</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPende_11</name>
					<description>Clear Pending for interrupt #11 (exception #27)</description>
					<bitOffset>11</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPende_10</name>
					<description>Clear Pending for interrupt #10 (exception #26)</description>
					<bitOffset>10</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPende_09</name>
					<description>Clear Pending for interrupt #09 (exception #25)</description>
					<bitOffset>09</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPende_08</name>
					<description>Clear Pending for interrupt #08 (exception #24)</description>
					<bitOffset>08</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPende_07</name>
					<description>Clear Pending for interrupt #07 (exception #23)</description>
					<bitOffset>07</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPende_06</name>
					<description>Clear Pending for interrupt #06 (exception #22)</description>
					<bitOffset>06</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPende_05</name>
					<description>Clear Pending for interrupt #05 (exception #21)</description>
					<bitOffset>05</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPende_04</name>
					<description>Clear Pending for interrupt #04 (exception #20)</description>
					<bitOffset>04</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPende_03</name>
					<description>Clear Pending for interrupt #03 (exception #19)</description>
					<bitOffset>03</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPende_02</name>
					<description>Clear Pending for interrupt #02 (exception #18)</description>
					<bitOffset>02</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ClearPende_01</name>
					<description>Clear Pending for interrupt #01 (exception #17)</description>
					<bitOffset>01</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SetEnable_00</name>
					<description>Clear Pending for interrupt #00 (exception #16)</description>
					<bitOffset>00</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
			</fields>
		</register>
        <register>
			<name>NVIC_IPR0</name>
			<description>NVIC Priority level for interrupt 0 to 3</description>
			<addressOffset>0x400</addressOffset>
			<size>32</size>
			<access>read-write</access>
			<fields>
				<field>
					<name>PRI_3</name>
					<description>Priority of interrupt number 3</description>
					<bitOffset>30</bitOffset>
					<bitWidth>2</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>PRI_2</name>
					<description>Priority of interrupt number 2</description>
					<bitOffset>22</bitOffset>
					<bitWidth>2</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>PRI_1</name>
					<description>Priority of interrupt number 1</description>
					<bitOffset>14</bitOffset>
					<bitWidth>2</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>PRI_0</name>
					<description>Priority of interrupt number 0</description>
					<bitOffset>22</bitOffset>
					<bitWidth>6</bitWidth>
					<access>read-write</access>
				</field>
			</fields>
		</register>
        <register>
			<name>NVIC_IPR1</name>
			<description>NVIC Priority level for interrupt 4 to 7</description>
			<addressOffset>0x404</addressOffset>
			<size>32</size>
			<access>read-write</access>
			<fields>
				<field>
					<name>PRI_7</name>
					<description>Priority of interrupt number 7</description>
					<bitOffset>30</bitOffset>
					<bitWidth>2</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>PRI_6</name>
					<description>Priority of interrupt number 6</description>
					<bitOffset>22</bitOffset>
					<bitWidth>2</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>PRI_5</name>
					<description>Priority of interrupt number 5</description>
					<bitOffset>14</bitOffset>
					<bitWidth>2</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>PRI_4</name>
					<description>Priority of interrupt number 4</description>
					<bitOffset>22</bitOffset>
					<bitWidth>6</bitWidth>
					<access>read-write</access>
				</field>
			</fields>
		</register>
        <register>
			<name>NVIC_IPR2</name>
			<description>NVIC Priority level for interrupt 8 to 11</description>
			<addressOffset>0x408</addressOffset>
			<size>32</size>
			<access>read-write</access>
			<fields>
				<field>
					<name>PRI_11</name>
					<description>Priority of interrupt number 11</description>
					<bitOffset>30</bitOffset>
					<bitWidth>2</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>PRI_10</name>
					<description>Priority of interrupt number 10</description>
					<bitOffset>22</bitOffset>
					<bitWidth>2</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>PRI_9</name>
					<description>Priority of interrupt number 9</description>
					<bitOffset>14</bitOffset>
					<bitWidth>2</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>PRI_8</name>
					<description>Priority of interrupt number 8</description>
					<bitOffset>22</bitOffset>
					<bitWidth>6</bitWidth>
					<access>read-write</access>
				</field>
			</fields>
		</register>
        <register>
			<name>NVIC_IPR3</name>
			<description>NVIC Priority level for interrupt 12 to 15</description>
			<addressOffset>0x40c</addressOffset>
			<size>32</size>
			<access>read-write</access>
			<fields>
				<field>
					<name>PRI_15</name>
					<description>Priority of interrupt number 15</description>
					<bitOffset>30</bitOffset>
					<bitWidth>2</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>PRI_14</name>
					<description>Priority of interrupt number 14</description>
					<bitOffset>22</bitOffset>
					<bitWidth>2</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>PRI_13</name>
					<description>Priority of interrupt number 13</description>
					<bitOffset>14</bitOffset>
					<bitWidth>2</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>PRI_12</name>
					<description>Priority of interrupt number 12</description>
					<bitOffset>22</bitOffset>
					<bitWidth>6</bitWidth>
					<access>read-write</access>
				</field>
			</fields>
		</register>
        <register>
			<name>NVIC_IPR4</name>
			<description>NVIC Priority level for interrupt 16 to 19</description>
			<addressOffset>0x410</addressOffset>
			<size>32</size>
			<access>read-write</access>
			<fields>
				<field>
					<name>PRI_19</name>
					<description>Priority of interrupt number 19</description>
					<bitOffset>30</bitOffset>
					<bitWidth>2</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>PRI_18</name>
					<description>Priority of interrupt number 18</description>
					<bitOffset>22</bitOffset>
					<bitWidth>2</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>PRI_17</name>
					<description>Priority of interrupt number 17</description>
					<bitOffset>14</bitOffset>
					<bitWidth>2</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>PRI_16</name>
					<description>Priority of interrupt number 16</description>
					<bitOffset>22</bitOffset>
					<bitWidth>6</bitWidth>
					<access>read-write</access>
				</field>
			</fields>
		</register>
        <register>
			<name>NVIC_IPR5</name>
			<description>NVIC Priority level for interrupt 20 to 23</description>
			<addressOffset>0x414</addressOffset>
			<size>32</size>
			<access>read-write</access>
			<fields>
				<field>
					<name>PRI_23</name>
					<description>Priority of interrupt number 23</description>
					<bitOffset>30</bitOffset>
					<bitWidth>2</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>PRI_22</name>
					<description>Priority of interrupt number 22</description>
					<bitOffset>22</bitOffset>
					<bitWidth>2</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>PRI_21</name>
					<description>Priority of interrupt number 21</description>
					<bitOffset>14</bitOffset>
					<bitWidth>2</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>PRI_20</name>
					<description>Priority of interrupt number 20</description>
					<bitOffset>22</bitOffset>
					<bitWidth>6</bitWidth>
					<access>read-write</access>
				</field>
			</fields>
		</register>
        <register>
			<name>NVIC_IPR6</name>
			<description>NVIC Priority level for interrupt 24 to 27</description>
			<addressOffset>0x418</addressOffset>
			<size>32</size>
			<access>read-write</access>
			<fields>
				<field>
					<name>PRI_27</name>
					<description>Priority of interrupt number 27</description>
					<bitOffset>30</bitOffset>
					<bitWidth>2</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>PRI_26</name>
					<description>Priority of interrupt number 26</description>
					<bitOffset>22</bitOffset>
					<bitWidth>2</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>PRI_25</name>
					<description>Priority of interrupt number 25</description>
					<bitOffset>14</bitOffset>
					<bitWidth>2</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>PRI_24</name>
					<description>Priority of interrupt number 24</description>
					<bitOffset>22</bitOffset>
					<bitWidth>6</bitWidth>
					<access>read-write</access>
				</field>
			</fields>
		</register>
        <register>
			<name>NVIC_IPR7</name>
			<description>NVIC Priority level for interrupt 28 to 31</description>
			<addressOffset>0x41c</addressOffset>
			<size>32</size>
			<access>read-write</access>
			<fields>
				<field>
					<name>PRI_31</name>
					<description>Priority of interrupt number 31</description>
					<bitOffset>30</bitOffset>
					<bitWidth>2</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>PRI_30</name>
					<description>Priority of interrupt number 30</description>
					<bitOffset>22</bitOffset>
					<bitWidth>2</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>PRI_29</name>
					<description>Priority of interrupt number 29</description>
					<bitOffset>14</bitOffset>
					<bitWidth>2</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>PRI_28</name>
					<description>Priority of interrupt number 28</description>
					<bitOffset>22</bitOffset>
					<bitWidth>6</bitWidth>
					<access>read-write</access>
				</field>
			</fields>
		</register>
