damiMela/TC1-RLC-Meter/NXP845/RLC_MeterV2/Debug/LPC84x_peripheral.xml
        <register>
			<name>SCB_CPUID</name>
			<description>CPU ID Base Register</description>
			<addressOffset>0xD00</addressOffset>
			<size>32</size>
			<access>read-only</access>
			<fields>
				<field>
					<name>IMPLEMENTER</name>
					<description>Implementer code</description>
					<bitOffset>24</bitOffset>
					<bitWidth>8</bitWidth>
					<access>read-only</access>
				</field>
				<field>
					<name>VARIANT</name>
					<description>Variant number</description>
					<bitOffset>20</bitOffset>
					<bitWidth>4</bitWidth>
					<access>read-only</access>
				</field>
				<field>
					<name>ARCHITECTURE</name>
					<description>Reads as 0xC for ARMv6-M parts</description>
					<bitOffset>16</bitOffset>
					<bitWidth>4</bitWidth>
					<access>read-only</access>
				</field>
				<field>
					<name>PARTNO</name>
					<description>Number of processor within family</description>
					<bitOffset>4</bitOffset>
					<bitWidth>12</bitWidth>
					<access>read-only</access>
				</field>
				<field>
					<name>REVISION</name>
					<description>Revision number</description>
					<bitOffset>0</bitOffset>
					<bitWidth>4</bitWidth>
					<access>read-only</access>
				</field>
			</fields>
		</register>
        <register>
			<name>SCB_ICSR</name>
			<description>Interrupt Control State Register</description>
			<addressOffset>0xd04</addressOffset>
			<size>32</size>
			<access>read-write</access>
			<fields>
				<field>
					<name>NMIPENDSET</name>
					<description>Set pending NMI bit</description>
					<bitOffset>31</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>PENDSVSET</name>
					<description>Set pending pendSV bit</description>
					<bitOffset>28</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>PENDSVCLR</name>
					<description>Clear pending pendSV bit</description>
					<bitOffset>27</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>PENDSTSET</name>
					<description>Set a pending SysTick bit</description>
					<bitOffset>26</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>PENDSTCLR</name>
					<description>Clear pending SysTick bit</description>
					<bitOffset>25</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ISRPREEMPT</name>
					<description>Pending interrupt on coming out of debug</description>
					<bitOffset>23</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ISRPENDING</name>
					<description>Interrupt pending flag (excluding NMI and Fault)</description>
					<bitOffset>22</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>VECTPENDING</name>
					<description>Pending ISR interrupt number</description>
					<bitOffset>12</bitOffset>
					<bitWidth>6</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>VECTACTIVE</name>
					<description>Active ISR interrupt number</description>
					<bitOffset>0</bitOffset>
					<bitWidth>6</bitWidth>
					<access>read-write</access>
				</field>
			</fields>
			
		</register>
        <register>
			<name>VECT_OFFSET</name>
			<description>Vector Table Offset Register</description>
			<addressOffset>0xd08</addressOffset>
			<size>32</size>
			<access>read-only</access>
		</register>
        <register>
			<name>SCB_AIRCR</name>
			<description>Application Interrupt and Reset Control Register</description>
			<addressOffset>0xd0c</addressOffset>
			<size>32</size>
			<access>read-write</access>
			<fields>
				<field>
					<name>VECTKEY</name>
					<description>Register Key</description>
					<bitOffset>16</bitOffset>
					<bitWidth>16</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>ENDIANESS</name>
					<description>Data endianess bit</description>
					<bitOffset>15</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SYSRESETREQ</name>
					<description>Force an outside of core system reset</description>
					<bitOffset>2</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>VECTCLRACTIVE</name>
					<description>Clear active vector bit</description>
					<bitOffset>1</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
			</fields>
		</register>
        <register>
			<name>SCB_SCR</name>
			<description>System Control Register</description>
			<addressOffset>0xd10</addressOffset>
			<size>32</size>
			<access>read-write</access>
			<fields>
				<field>
					<name>SEVONPEND</name>
					<description>Cause WFE to wake on moving from inactive to pended</description>
					<bitOffset>4</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SLEEPDEEP</name>
					<description>Sleep deep bit</description>
					<bitOffset>2</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>SLEEPONEXIT</name>
					<description>Sleep when returning from Handler to Thread</description>
					<bitOffset>1</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
			</fields>
		</register>
        <register>
			<name>SCB_CCR</name>
			<description>Configuration Control Register</description>
			<addressOffset>0xd14</addressOffset>
			<size>32</size>
			<access>read-only</access>
			<fields>
				<field>
					<name>STKALIGN</name>
					<description>If set then stack is aligned to 8 on exception entry</description>
					<bitOffset>9</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-only</access>
				</field>
				<field>
					<name>UNALIGN_TRAP</name>
					<description>Trap for unaligned access</description>
					<bitOffset>3</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-only</access>
				</field>
			</fields>
		</register>
        <register>
			<name>SCB_SHR0</name>
			<description>System Handler Priority Register 2</description>
			<addressOffset>0xd1c</addressOffset>
			<size>32</size>
			<access>read-write</access>
			<fields>
				<field>
					<name>PRI_11</name>
					<description>rity of system handler 11 (SVCall)</description>
					<bitOffset>30</bitOffset>
					<bitWidth>2</bitWidth>
					<access>read-write</access>
				</field>
			</fields>
		</register>
        <register>
			<name>SCB_SHR1</name>
			<description>System Handler Priority Register 3</description>
			<addressOffset>0xd20</addressOffset>
			<size>32</size>
			<access>read-write</access>
			<fields>
				<field>
					<name>PRI_15</name>
					<description>Priority of system handler 15 (SysTick)</description>
					<bitOffset>30</bitOffset>
					<bitWidth>2</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>PRI_14</name>
					<description>Priority of system handler 14 (SysTick)</description>
					<bitOffset>22</bitOffset>
					<bitWidth>2</bitWidth>
					<access>read-write</access>
				</field>
			</fields>
		</register>
        <register>
			<name>SCB_SHCSR</name>
			<description>System Handler Control and State Register</description>
			<addressOffset>0xd24</addressOffset>
			<size>32</size>
			<access>read-write</access>
			<fields>
				<field>
					<name>SVCALLPENDED</name>
					<description>1 if SVCall pended</description>
					<bitOffset>15</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
			</fields>
		</register>
        <register>
			<name>DEBUG_FSR</name>
			<description>Debug Fault Status Register</description>
			<addressOffset>0xd30</addressOffset>
			<size>32</size>
			<access>read-write</access>
			<fields>
				<field>
					<name>EXTERNAL</name>
					<description>External debug request flag</description>
					<bitOffset>4</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>VCATCH</name>
					<description>Vector catch flag</description>
					<bitOffset>3</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>DWTTRAP</name>
					<description>Data watchpoint and Trace flag</description>
					<bitOffset>2</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>BKPT</name>
					<description>Breakpoint flag</description>
					<bitOffset>1</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
				<field>
					<name>HALTED</name>
					<description>Halt request flag</description>
					<bitOffset>0</bitOffset>
					<bitWidth>1</bitWidth>
					<access>read-write</access>
				</field>
			</fields>
		</register>
	</registers>
</peripheral>
  </peripherals>
</device>
